project/atropos-go/etcd_concurrent_read-master/PR/read_only/expensive_read.log
bench with linearizable range
 0 / 10 B                                                                                                                                                              !   0.00%INFO: 2023/06/05 17:44:13 ccResolverWrapper: sending new addresses to cc: [{http://localhost:2379 0  <nil>}]
 10 / 10 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.3308 secs.
  Slowest:	1.0392 secs.
  Fastest:	0.1817 secs.
  Average:	0.3121 secs.
  Stddev:	0.2465 secs.
  Requests/sec:	1.0717

Response time histogram:
  0.1817 [1]	|∎∎∎∎∎∎∎∎
  0.2675 [5]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.3532 [3]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.4390 [0]	|
  0.5247 [0]	|
  0.6105 [0]	|
  0.6962 [0]	|
  0.7820 [0]	|
  0.8677 [0]	|
  0.9535 [0]	|
  1.0392 [1]	|∎∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.1896 secs.
  25% in 0.1967 secs.
  50% in 0.2187 secs.
  75% in 0.3140 secs.
  90% in 1.0392 secs.